package main

import "fmt"

func main() {

	x := 18
	y := 17
	and := x & y  //16. = .10000
	or := x | y   //16. =. 10000
	exor := x ^ y //16 . .=. 10000
	fmt.Printf("binary %b\n", x)
	fmt.Printf("binary %b\n", y)

	//AND প্রতিটি বিটের জন্য কার্যকর হয়। যদি উভয় বিটই 1 হয়, তাহলে ফলাফল 1 হবে, অন্যথায় 0 হবে।
	fmt.Printf("x.&.y .= %v\n", and)
	//OR অপারেশন প্রতিটি বিটের জন্য কার্যকর হয়। যদি যে কোনো একটি বিট 1 হয়, তাহলে ফলাফল 1 হবে, অন্যথায় 0 হবে।
	fmt.Printf("x.|.y .= %v\n", or)
	//XOR অপারেশন প্রতিটি বিটের জন্য কার্যকর হয়। যদি দুটি বিট ভিন্ন হয় (একটি 1 এবং অন্যটি 0), তাহলে ফলাফল 1 হবে, অন্যথায় 0 হবে।
	fmt.Printf("x.^.y .= %v\n", exor)

}
